docs/vocabulary_development/auto-generated/md/definition-files/Quantities.md
```mermaid
classDiagram
DWISNoun <|-- MeasurableQuantity
MeasurableQuantity <|-- BitTorqueQuantity
MeasurableQuantity <|-- BlockAccelerationQuantity
MeasurableQuantity <|-- BlockPositionQuantity
MeasurableQuantity <|-- BlockVelocityQuantity
MeasurableQuantity <|-- DepthQuantity
MeasurableQuantity <|-- DownholePressureQuantity
MeasurableQuantity <|-- EMWQuantity
MeasurableQuantity <|-- FlowRateQuantity
MeasurableQuantity <|-- FluidDensityInQuantity
MeasurableQuantity <|-- FluidTemperatureInQuantity
MeasurableQuantity <|-- FormationPorosityQuantity
MeasurableQuantity <|-- HookloadQuantity
MeasurableQuantity <|-- PumpRateQuantity
MeasurableQuantity <|-- Resistivity
MeasurableQuantity <|-- RockDensityQuantity
MeasurableQuantity <|-- SPPQuantity
MeasurableQuantity <|-- SurfaceRPMQuantity
MeasurableQuantity <|-- SurfaceTorqueQuantity
MeasurableQuantity <|-- TopOfStringForceQuantity
MeasurableQuantity <|-- TVDQuantity
MeasurableQuantity <|-- WOBQuantity
DWISNoun <|-- MeasurableQuantityUnitAssociation
DWISNoun <|-- Quantity
Quantity <|-- AccelerationQuantity
Quantity <|-- AreaQuantity
Quantity <|-- ElectricResistivityQuantity
Quantity <|-- ForceQuantity
Quantity <|-- FrequencyQuantity
Quantity <|-- LengthQuantity
Quantity <|-- MassDensityQuantity
Quantity <|-- MassQuantity
Quantity <|-- MassRate
Quantity <|-- PowerQuantity
Quantity <|-- PressureQuantity
Quantity <|-- ProportionQuantity
Quantity <|-- TemperatureQuantity
Quantity <|-- TorqueQuantity
Quantity <|-- VelocityQuantity
Quantity <|-- VolumeQuantity
Quantity <|-- VolumetricRateQuantity
Quantity <|-- VolumetricFlowateRateOfChangeQuantity
DWISNoun <|-- Unit
DWISNoun <|-- UnitSystem
```
