docs/vocabulary_development/dotfiles/Quantities.dot
strict digraph  {
VolumeQuantity;
DownholePressureQuantity;
HookloadQuantity;
TopOfStringForceQuantity;
Quantity;
ForceQuantity;
MassQuantity;
AccelerationQuantity;
VelocityQuantity;
DepthQuantity;
ElectricResistivityQuantity;
Resistivity;
ProportionQuantity;
AreaQuantity;
BlockPositionQuantity;
EMWQuantity;
FlowRateQuantity;
FluidTemperatureInQuantity;
Unit;
PressureQuantity;
RockDensityQuantity;
MassRate;
MassDensityQuantity;
SurfaceTorqueQuantity;
SPPQuantity;
DDHubNode;
TemperatureQuantity;
UnitSystem;
TVDQuantity;
BlockVelocityQuantity;
MeasurableQuantityUnitAssociation;
BlockAccelerationQuantity;
PumpRateQuantity;
MeasurableQuantity;
FrequencyQuantity;
PowerQuantity;
TorqueQuantity;
BitTorqueQuantity;
FluidDensityInQuantity;
FormationPorosityQuantity;
SurfaceRPMQuantity;
VolumetricRateQuantity;
WOBQuantity;
LengthQuantity;
VolumeQuantity -> Quantity  [label=SUBCLASS_OF];
DownholePressureQuantity -> MeasurableQuantity  [label=SUBCLASS_OF];
HookloadQuantity -> MeasurableQuantity  [label=SUBCLASS_OF];
TopOfStringForceQuantity -> MeasurableQuantity  [label=SUBCLASS_OF];
Quantity -> DDHubNode  [label=SUBCLASS_OF];
ForceQuantity -> Quantity  [label=SUBCLASS_OF];
MassQuantity -> Quantity  [label=SUBCLASS_OF];
AccelerationQuantity -> Quantity  [label=SUBCLASS_OF];
VelocityQuantity -> Quantity  [label=SUBCLASS_OF];
DepthQuantity -> MeasurableQuantity  [label=SUBCLASS_OF];
ElectricResistivityQuantity -> Quantity  [label=SUBCLASS_OF];
Resistivity -> MeasurableQuantity  [label=SUBCLASS_OF];
ProportionQuantity -> Quantity  [label=SUBCLASS_OF];
AreaQuantity -> Quantity  [label=SUBCLASS_OF];
BlockPositionQuantity -> MeasurableQuantity  [label=SUBCLASS_OF];
EMWQuantity -> MeasurableQuantity  [label=SUBCLASS_OF];
FlowRateQuantity -> MeasurableQuantity  [label=SUBCLASS_OF];
FluidTemperatureInQuantity -> MeasurableQuantity  [label=SUBCLASS_OF];
Unit -> DDHubNode  [label=SUBCLASS_OF];
PressureQuantity -> Quantity  [label=SUBCLASS_OF];
RockDensityQuantity -> MeasurableQuantity  [label=SUBCLASS_OF];
MassRate -> Quantity  [label=SUBCLASS_OF];
MassDensityQuantity -> Quantity  [label=SUBCLASS_OF];
SurfaceTorqueQuantity -> MeasurableQuantity  [label=SUBCLASS_OF];
SPPQuantity -> MeasurableQuantity  [label=SUBCLASS_OF];
TemperatureQuantity -> Quantity  [label=SUBCLASS_OF];
UnitSystem -> DDHubNode  [label=SUBCLASS_OF];
TVDQuantity -> MeasurableQuantity  [label=SUBCLASS_OF];
BlockVelocityQuantity -> MeasurableQuantity  [label=SUBCLASS_OF];
MeasurableQuantityUnitAssociation -> DDHubNode  [label=SUBCLASS_OF];
BlockAccelerationQuantity -> MeasurableQuantity  [label=SUBCLASS_OF];
PumpRateQuantity -> MeasurableQuantity  [label=SUBCLASS_OF];
MeasurableQuantity -> DDHubNode  [label=SUBCLASS_OF];
FrequencyQuantity -> Quantity  [label=SUBCLASS_OF];
PowerQuantity -> Quantity  [label=SUBCLASS_OF];
TorqueQuantity -> Quantity  [label=SUBCLASS_OF];
BitTorqueQuantity -> MeasurableQuantity  [label=SUBCLASS_OF];
FluidDensityInQuantity -> MeasurableQuantity  [label=SUBCLASS_OF];
FormationPorosityQuantity -> MeasurableQuantity  [label=SUBCLASS_OF];
SurfaceRPMQuantity -> MeasurableQuantity  [label=SUBCLASS_OF];
VolumetricRateQuantity -> Quantity  [label=SUBCLASS_OF];
WOBQuantity -> MeasurableQuantity  [label=SUBCLASS_OF];
LengthQuantity -> Quantity  [label=SUBCLASS_OF];
}
